/*7-1*/
/*文字列"Please find the substring in this string"の17文字目から25文字目までの文字列を返すクエリを作る.*/
select substring('Please find the substring in this string', 17, 9);
/*
+--------------------------------------------------------------+
| substring('Please find the substring in this string', 17, 9) |
+--------------------------------------------------------------+
| substring                                                    |
+--------------------------------------------------------------+
1 row in set
Time: 0.006s
*/

/*7-2*/
/*-25.76823の絶対値と符号(-1, 0, または1)を返すクエリを作成する。また、小数点以下で丸めた値も返す。*/
select abs(-25.76823), sign(-25.76823), round(-25.76823, 1);
/*
+----------------+-----------------+---------------------+
| abs(-25.76823) | sign(-25.76823) | round(-25.76823, 1) |
+----------------+-----------------+---------------------+
| 25.76823       | -1              | -25.8               |
+----------------+-----------------+---------------------+
1 row in set
Time: 0.007s
*/

/*7-3*/
/*現在の日付から月の部分だけを返すクエリを作成する*/
select extract(month from current_time());
/*
+------------------------------------+
| extract(month from current_time()) |
+------------------------------------+
| 4                                  |
+------------------------------------+
1 row in set
Time: 0.005s
*/
